# PrintSetting Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintSetting Class
Members See Also
---
Represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PrintSetting : Element,
	IPrintSetting
```

Visual Basic
---
```text
Public Class PrintSetting _
	Inherits Element _
	Implements IPrintSetting
```

Visual C++
---
```text
public ref class PrintSetting : public Element,
	IPrintSetting
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..PrintSetting
# See Also
PrintSetting Members
Autodesk.Revit.DB Namespace